<script>
import { RouterLink, RouterView } from "vue-router";

export default {
  components: {},
  data() {
    return {};
  },
  mounted() {},
  methods: {},
};
</script>

<template>
  <div class="wrapper">
    <h1 class="text">Политика конфиденциальности</h1>
    <p>
      Политика конфиденциальности для платформы "ПрофТестиум" обучения и
      тестирования сотрудников рабочих профессий:
      <br>
      1. Сбор и использование
      информации: Мы собираем и используем информацию, необходимую для
      предоставления услуг нашей платформы "ПрофТестиум". Это включает в себя
      информацию, предоставленную пользователями при регистрации, обучении и
      тестировании.
      <br>
      2. Виды собираемой информации: Мы можем собирать следующие
      типы информации: - Персональная информация: имя, адрес электронной почты,
      контактная информация и другие данные, необходимые для идентификации и
      связи с пользователем. - Информация о профессиональных навыках: данные о
      профессиональном опыте и навыках сотрудников, предоставленные
      работодателем или пользователем. - Данные об учебных и тестовых
      результатах: информация о результатах тренировок и тестов пользователей,
      которые помогают нам адаптировать и улучшать содержание и предлагать более
      эффективные обучающие программы. 
      <br>
      3. Использование информации: Мы
      используем собранную информацию для следующих целей: - Предоставление
      услуг и выполнение запросов пользователей. - Персонализация контента и
      разработка индивидуальных обучающих программ. - Улучшение качества
      обучения и тестирования на основе обратной связи пользователей. -
      Статистический анализ и исследования для разработки новых функций и
      улучшения платформы. 
      <br>
      4. Разглашение информации: Мы не разглашаем
      персональную информацию пользователей третьим лицам без их согласия, за
      исключением случаев, когда это необходимо для предоставления услуг и
      выполнения обязательств перед пользователем. 
      <br>
      5. Защита информации и
      безопасность: Мы принимаем меры для защиты персональной информации
      пользователей и обеспечения безопасности их данных. Мы используем
      современные технологии и процедуры для предотвращения несанкционированного
      доступа, использования или разглашения информации. 
      <br>
      6. Согласие с политикой
      конфиденциальности: Использование нашей платформы "ПрофТестиум"
      подразумевает согласие пользователей с нашей политикой конфиденциальности.
      Если пользователь не согласен с политикой конфиденциальности, он не должен
      использовать нашу платформу. 
      <br>
      7. Изменение политики конфиденциальности: Мы
      оставляем за собой право изменять политику конфиденциальности. В случае
      внесения изменений мы уведомим пользователей по электронной почте или
      публикацией обновленной версии на нашем веб-сайте. Это общая политика
      конфиденциальности нашей платформы "ПрофТестиум". Мы принимаем защиту
      ваших персональных данных и обеспечение конфиденциальности с большой
      серьезностью. Если у вас возникнут дополнительные вопросы, пожалуйста,
      свяжитесь с нами для получения дополнительной информации.
    </p>
  </div>
</template>

<style scoped>
.text {
  color: #950707;
  text-align: center;
}

.wrapper p {
  font-size: 17px;
}

.wrapper {
  padding: 0 70px;
}

@media (max-width: 1100px) {
  .wrapper {
    padding: 0 10px;
  }

  .wrapper p {
    font-size: 12px;
    line-height: 1.3;
  }
}

@media (max-width: 480px) {
  .wrapper {
    padding: 0 10px;
  }

  .wrapper p {
    font-size: 10px;
    line-height: 1.3;
  }
}
</style>
